<!DOCTYPE html>
<html>
<head>
	<link rel="stylesheet" type="text/css" href="css/styles.css">
	<title>El Resume loquillo</title>
</head>
<body>
	<header>
		<h1>Diego Al&iacute; L&oacute;pez &Aacute;lvarez</h1>
	</header>
	<section id="data">
		<label>Fecha de nacimiento: 7 de marzo de 1996</label>
		<label>dali.lopalz@gmail.com</label>
		<label>Monterrey, Nuevo Le&oacute;n, M&eacute;xico</label>
		<label>[+52] 4434809728</label>
		<label>/dali-lopalz</label>
	</section>
	<div>
		<fieldset>
			<legend><h2>Intereses</h2></legend>
			Investigaci&oacute;n de nuevas tecnolog&iacute;as para mejorar la calidad de vida humana. Desarrollo de dispositivos y aplicaciones innovadora, 
			aplicando nuevas tendencias para optimizar la productividad. Implementaci&oacute;n de Interner of Things e inteligencia artificial.
		</fieldset>
	</div>
	<div>
		
		<fieldset>
			<legend><h2>Educaci&oacute;n</h2></legend>
			Estudiante de 9no semestre de Ingenier&iacute;a en Sistemas Digitales y Rob&oacute;tica en el Instituto Tecnol&oacute;gico y de Estudios Superiores de Monterrey
			(ITESM), con conocimiento de hardware, circuitos, electr&oacute;nica, microcontroladores y tarjetas de desarrollo para sistemas embebidos. Uso de
			distintos lenguajes de programaci&oacute;n en todos los niveles de abstracci&oacute;n. 
		</fieldset>
	</div>
	<div>
		
		<fieldset id="progLang">
			<legend><h2>Lenguajes de Programaci&oacute;n</h2></legend>
			Ensamblador, C, C++, C#, Arduino, VHDL, Python, MATLAB, Java, Processing, HTML
		</fieldset>
	</div>
	<div>
		
		<fieldset>
			<legend><h2>Experiencia</h2></legend>
			<ul>
				<li>Intern de IBM México, en el área de TI de Global Business Services </li>
				<li>[Proyecto] Desarrollo de programa de reconocimiento de objetos para la detecci&oacute;n de figuras y establecer caminos a seguir
				 seg&uacute;n obst&aacute;culos utilizando un algoritmo de Rapidly-exploring Random Tree (RRT)</li>
				<li>Instructor de "Semana i" donde se enseñ&oacute; a estudiantes de ITESM a desarrollar una aplicaci&oacute;n WPF utilizando Visual Studio y el dispositivo
				Kinect de Microsoft</li>
				<li>[Proyecto] "Sensorial Rehabilitiation" desarrollo de un dispositivo para para mejorar la experiencia de la rehabilitaci&oacute;n f&iacute;sica utilizando
				estimulaci&oacute;n sensorial y conectividad con la nube obteniendo el 3er lugar en el Microsoft Imagine Cup 2017 Mexico Finals</li>
				<li>[Proyecto] Pequeño autom&oacute;vil con 4 grados de libertad basado en Arduino controlado por diadema Emotiv Insight de electroencefalograf&iacute;a</li>
				<li>[Proyecto] Diseño de un lenguaje de programaci&oacute;n propio utilizando Python para traducir y ejecutar el c&oacute;digo</li>
				<li>Instructor de servicio social Minirob&oacute;tica y Sin Miedo a la Corriente donde se ofrece a estudiantes de educaci&oacute;n b&aacute;sica clases de 
				electr&oacute;nica y rob&oacute;tica b&aacute;sica</li>

			</ul>
		</fieldset>
	</div>
	<div>
		<fieldset>
			<legend><h2>Lenguajes</h2></legend>
			<label>Ingl&eacute;s(Avanzado)</label>
			<label>Franc&eacute;s(B&aacute;sico)</label>
		</fieldset>
	</div>
	<div >
		<fieldset>
			<legend><h2>Formaci&oacute;n extracurricular</h2></legend>
			<label>Formaci&oacute;n en artes pl&aacute;sticas, artista independiente de pintura y escultura, expositor en "Arte Tec"</label>
		</fieldset>
	</div>
</body>
</html>